{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 5, 34], "name": "masking_1", "mask_value": -1, "dtype": "float32"}, "class_name": "Masking"}, {"config": {"bias_regularizer": null, "unroll": false, "activity_regularizer": null, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "return_state": false, "implementation": 1, "kernel_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "use_bias": true, "dropout": 0.2, "stateful": false, "recurrent_constraint": null, "units": 32}, "class_name": "LSTM"}, {"config": {"batch_input_shape": [null, 32], "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "units": 18, "activation": "linear", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}